[
    {
        "id": 8,
        "name": "E-Commerce Cargo Integration",
        "image": "/kolaygelsinlogo.png",
        "tech": [
            "Go",
            "React",
            "Mantine UI",
            "Sass",
            "Framer-Motion",
            "React Router"
        ],
        "description": "In this project I created a web app where for Devecioglu, a well know e-commerce company. The app is providing integration between sales office and the cargo company Kolay Gelsin. Kolay Gelsin is young and rapidly growing cargo company in Turkey. They are mostly known for their latest deal with Amazon. Because both companies are relatively young, bigger e-commerce integration companies are still to adopt them to the their ecosystem. This opens up an opportunity window for freelancers like me.",
        "link": "https://devecioglu.com.tr/"
    },
    {
        "id": 7,
        "name": "E-Commerce Fullfilment and Products Management",
        "image": "/LogoSwiss.jpg",
        "tech": [
            "Go",
            "React",
            "Mantine UI",
            "Sass",
            "Framer-Motion",
            "React Router"
        ],
        "description": "Swiss Gadget is an Austrian e-commerce company that is growing steadily and taking an ever incresing share from the Austrian e-commmerce market. This project helped the company to streamline their product and stocks management. They are receiving products from a number of different suppliers. Managing those products and stocks without an integration system is difficult. With this project I eased up that pain. Also I created an integration system with fullfilllment center, which helped eradicating a lot of error prone, time consuming manual work.",
        "link": "https://swissgadget.ch"
    },
    {
        "id": 6,
        "name": "E-Commerce Integration App",
        "image": "p1/dashboard-md.jpg",
        "tech": [
            "Go",
            "React",
            "MongoDB",
            "Material UI",
            "Sass",
            "Framer-Motion",
            "React Router"
        ],
        "description": "A web app project, which helps clients to integrate different parts of their e-commerce system. There are a lot of integration systems out there. This one differs in the way that, it provides customized solutions to each customer in their own dashboard.",
        "link": "https://converter-lyza.onrender.com"
    },
    {
        "id": 5,
        "name": "Air Traffic Communications",
        "image": "p2/ifrmap-md.png",
        "tech": ["Typescript", "React", "Next", "Sass", "Framer-Motion"],
        "description": "A website to help aviators to practice their radio communication skills. It provides voice recordings from real life air traffic communications. There is a questions section as well in which visitors can test their listening skills. Its planned to grow to be a gub where users can submit their own examples and get reviews and feedbacks.",
        "link": "https://radiocom.vercel.app/"
    },
    {
        "id": 4,
        "name": "Blur Game",
        "image": "p3/blur-md.png",
        "tech": ["React", "Next", "Material UI"],
        "description": "A game that blurs the images and makes you find the objects in the image. It's not only intended for kids that are learning new words, but also adults who are studying English. There is a level system in which you can compare your overall score with other players.",
        "link": ""
    },
    {
        "id": 3,
        "name": "Doctor's Office Landing Page",
        "image": "p4/md-md.png",
        "tech": ["React", "Next", "Sass", "Formik"],
        "description": "A landing page for doctor's office. Includes a contact form implemented via Formik library.",
        "link": "https://md-snowy.vercel.app/"
    },
    {
        "id": 2,
        "name": "ShowNote CLI tool for TaskWarrior©",
        "image": "p5/shownote-md.png",
        "tech": ["Go", "Makefile"],
        "description": "This CLI tool adds note-taking functionality to TaskWarrior(TW). TW is a CLI todo app with lots of great features, but one thing it lacks, is an improved note-taking system. It had a annotation feature, however, its limited in functionality. And, in practice, it's limited to just a couple of words. ShowNote CLI App bridges that gap by adding note-taking functionality to TW. It's desinged to communicate over the API so that it's decoupled in functionality and friction is minimum.",
        "link": "https://github.com/farukara/shownote"
    },
    {
        "id": 1,
        "name": "Creating an Integration System for an E-Commerce Client",
        "image": "",
        "tech": ["Go", "React", "Rest", "SOAP"],
        "description": "In this project, client needed all his api providers to be integrated into a central system and then fed into their e-commerce website. The api providers were using different architectures such as REST and SOAP. I help them centralize all this complex system into a user-friendly, easy-to-use, management infrastructure.",
        "link": "https://oguslarkia.com/"
    }
]
